"use client";
import React from "react";
import Image from "next/image";
import { motion } from "framer-motion";
const Statistics = () => {
  return (
    <div className="mt-30 px-6 mx-auto max-w-7xl">
      <motion.div
        initial={{
          opacity: 0,
          y: 50,
        }}
        whileInView={{
          opacity: 1,
          y: 0,
        }}
        viewport={{
          once: true,
        }}
        transition={{
          duration: 0.8,
        }}
      >
        <div>
          <h3 className="text-[24px] text-center font-bold text-[var(--primary-1)]">
            من نحن؟
          </h3>
          <p className="text-[32px] font-bold text-[var(--text)] text-center mb-7">
            الفكرة العامة لشركة الوصل
          </p>
        </div>
        <div className="flex-col flex items-center md:flex-row justify-between">
          <div className="flex flex-col gap justify-between">
            <p className="text-[var(--text)] text-[18px]">
              شركة الوصل متخصصة في تقديم الحلول الرقمية المتكاملة، نساعد
              المؤسسات والأفراد على تحويل أفكارهم إلى منتجات رقمية ناجحة من خلال
              تطوير المواقع الإلكترونية والتطبيقات الذكية، وتقديم الاستشارات
              التقنية، وبناء حلول الذكاء الاصطناعي المبتكرة. نؤمن بأن التقنية هي
              المحرك الأساسي للنمو، لذلك نسعى إلى تقديم خدمات عالية الجودة تجمع
              بين الإبداع والكفاءة لتحقيق أفضل النتائج لعملائنا.
            </p>
            <p className="text-[var(--text)] mt-5 text-[18px]">
              طورت شركة الوصل إمكانات جديدة فيما يخص الذكاء الاصطناعي في اصدارها
              الجديد Al-Wasel AI بمفاهيم رائعة توفر تحليل وتوصيات وتوقعات لأداء
              الطلاب وهذه الخدمات تم توفيرها لولي الأمر من خلال تطبيق الجوال كما
              تم الاستفادة من تقنيات الذكاء الاصطناعي فيما يخص الموارد التعليمية
              للطالب والمعلم، من جهة أخرى وفرت تقنيات الذكاء الاصطناعي مساعد آلي
              لمساعدة زوار المنصة للوصول للخدمات الخاصة بالتسجيل أو الخدمات
              الإدارية والمالية بشكل سهل ومرن.
            </p>
            <p className="text-[var(--text)] mt-5 text-[18px]">
              يدعم Al-Wasel اللغتين العربية والانجليزية مع الدعم الكامل لنظم
              التعليم الدولية الأمريكية والبريطانية ونظام التعليم المحلي في منصة
              واحدة، وقد حققت تطبيقات الجوال في Al-Wasel طفرة كبيرة سبقت جميع
              النظم التعليمية في تحقيق معايير عالية للجودة في العملية التعليمية
              بين الطلاب والمعلمين وتواصل فعال مع أولياء الأمور وتقديم خدمات
              إلكترونية تعليمية وإدارية متنوعة
            </p>
          </div>

          <Image src={"/us.png"} alt="us" width={500} height={500} />
        </div>
      </motion.div>
      <motion.div
        initial={{
          opacity: 0,
          y: 50,
        }}
        whileInView={{
          opacity: 1,
          y: 0,
        }}
        viewport={{
          once: true,
        }}
        transition={{
          duration: 0.8,
        }}
      >
        <div
          dir="ltr"
          className="my-10 flex-col flex items-center md:flex-row justify-between"
        >
          <div className="flex flex-col gap justify-between max-w-[750px]">
            <p className="text-right text-[var(--text)] text-[18px]">
              شركة الوصل متخصصة في تقديم الحلول الرقمية المتكاملة، نساعد
              المؤسسات والأفراد على تحويل أفكارهم إلى منتجات رقمية ناجحة من خلال
              تطوير المواقع الإلكترونية والتطبيقات الذكية، وتقديم الاستشارات
              التقنية، وبناء حلول الذكاء الاصطناعي المبتكرة. نؤمن بأن التقنية هي
              المحرك الأساسي للنمو، لذلك نسعى إلى تقديم خدمات عالية الجودة تجمع
              بين الإبداع والكفاءة لتحقيق أفضل النتائج لعملائنا.
            </p>
            <p className="text-right text-[var(--text)] mt-5 text-[18px]">
              طورت شركة الوصل إمكانات جديدة فيما يخص الذكاء الاصطناعي في اصدارها
              الجديد Al-Wasel AI بمفاهيم رائعة توفر تحليل وتوصيات وتوقعات لأداء
              الطلاب وهذه الخدمات تم توفيرها لولي الأمر من خلال تطبيق الجوال كما
              تم الاستفادة من تقنيات الذكاء الاصطناعي فيما يخص الموارد التعليمية
              للطالب والمعلم، من جهة أخرى وفرت تقنيات الذكاء الاصطناعي مساعد آلي
              لمساعدة زوار المنصة للوصول للخدمات الخاصة بالتسجيل أو الخدمات
              الإدارية والمالية بشكل سهل ومرن.
            </p>
            <p className="text-right text-[var(--text)] mt-5 text-[18px]">
              يدعم Al-Wasel اللغتين العربية والانجليزية مع الدعم الكامل لنظم
              التعليم الدولية الأمريكية والبريطانية ونظام التعليم المحلي في منصة
              واحدة، وقد حققت تطبيقات الجوال في Al-Wasel طفرة كبيرة سبقت جميع
              النظم التعليمية في تحقيق معايير عالية للجودة في العملية التعليمية
              بين الطلاب والمعلمين وتواصل فعال مع أولياء الأمور وتقديم خدمات
              إلكترونية تعليمية وإدارية متنوعة
            </p>
          </div>

          <Image src={"/us2.jpg"} alt="us" width={400} height={400} />
        </div>
      </motion.div>
    </div>
  );
};

export default Statistics;
